<details><summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
~   update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-app_DC6398B6 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-app_DC6398B6" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/sandbox:8997d5457f403a539d702e059e722b551bf08ce2"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-sandbox-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 300

+       routes {
+           port  = (known after apply)
+           route = "07412af3-7551-415f-874c-2cc0bbed430e"
        }

+       service_binding {
+           service_instance = "f23a3230-e110-40e8-8060-d852facdc073"
        }
+       service_binding {
+           service_instance = "2f46db96-4060-4230-9473-159fa5838142"
        }
    }

  # cloudfoundry_app.tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4 will be updated in-place
~   resource "cloudfoundry_app" "tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4" {
~       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:f2df2b4915c3ac808d7a36ae99ba46ef30d6dfbc" -> "ghcr.io/gsa-tts/forms/server-doj:8997d5457f403a539d702e059e722b551bf08ce2"
        id                              = "8ad75c3a-28fa-430c-b723-404e19b35de8"
        name                            = "tts-10x-forms-dev-server-doj-app"
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

<!-- Sticky Pull Request Commentterraform-plan -->